/* Задача: Конвертер температуры

Напишите программу, которая позволяет пользователю конвертировать температуру из градусов 
Цельсия в градусы Фаренгейта и наоборот.

Пользователь должен ввести значение температуры и указать в какой шкале 
(C для Цельсия или F для Фаренгейта) данное значение представлено.
 Программа должна выполнить конвертацию и вывести результат.

Формула для конвертации из градусов Цельсия в градусы Фаренгейта:
F = (C * 9/5) + 32

Формула для конвертации из градусов Фаренгейта в градусы Цельсия:
C = (F - 32) * 5/9

Пример выполнения программы:

Введите температуру: 25
Выберите шкалу (C для Цельсия, F для Фаренгейта): C
Температура в градусах Фаренгейта: 77.0
Для решения этой задачи вам потребуется использовать ввод данных с клавиатуры,
 условные операторы (if/else) для определения выбора пользователя и 
 математические операции для выполнения конвертации. */

public static class TemperatureConverter
{
    public static void Start()
    {
        Console.Write("Введите температуру: ");
        Console.ReadLine();
        
        if (F = (C * 9/5) + 32 )
    }
}


